<!DOCTYPE html>
<!--
 | Generated by Apache Maven Doxia Site Renderer 1.11.1 from src/site/apt/devmemo/swingtest.apt at 2022-09-23

 | Rendered using Apache Maven Default Skin
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="generator" content="Apache Maven Doxia Site Renderer 1.11.1" />
    <title>javautils &#x2013; Swingアプリケーションのテスト</title>
    <link rel="stylesheet" href="../css/maven-base.css" />
    <link rel="stylesheet" href="../css/maven-theme.css" />
    <link rel="stylesheet" href="../css/site.css" />
    <link rel="stylesheet" href="../css/print.css" media="print" />
<link rel="shortcut icon" href="images/favicon.ico" />
  </head>
  <body class="composite">
    <div id="banner">
<div id="bannerLeft">javautils
</div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="breadcrumbs">
      <div class="xleft">
        <span id="publishDate">Last Published: 2022-09-23</span>
           | <span id="projectVersion">Version: 0.0.1-SNAPSHOT</span>
      </div>
      <div class="xright">      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
    <div id="leftColumn">
      <div id="navcolumn">
       <h5>Project Documentation</h5>
    <ul>
     <li class="collapsed"><a href="../project-info.html" title="Project Information">Project Information</a></li>
     <li class="collapsed"><a href="../project-reports.html" title="Project Reports">Project Reports</a></li>
    </ul>
      <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="../images/logos/maven-feather.png" />
      </a>
      </div>
    </div>
    <div id="bodyColumn">
      <div id="contentBox">
<section>
<h2><a name="Swing.E3.82.A2.E3.83.97.E3.83.AA.E3.82.B1.E3.83.BC.E3.82.B7.E3.83.A7.E3.83.B3.E3.81.AE.E3.83.86.E3.82.B9.E3.83.88"></a>Swing&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x30c6;&#x30b9;&#x30c8;</h2><section>
<h3><a name="a.E3.83.86.E3.82.B9.E3.83.88.E3.83.97.E3.83.AD.E3.82.B0.E3.83.A9.E3.83.A0.E3.81.AE.E4.BE.8B"></a>&#x30c6;&#x30b9;&#x30c8;&#x30d7;&#x30ed;&#x30b0;&#x30e9;&#x30e0;&#x306e;&#x4f8b;</h3>
<p>JUnit&#x306e;&#x30c6;&#x30b9;&#x30c8;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x304b;&#x3089;&#x3001;Swing&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x30b3;&#x30f3;&#x30dd;&#x30fc;&#x30cd;&#x30f3;&#x30c8;&#x306b;&#x30a2;&#x30af;&#x30bb;&#x30b9; &#x3059;&#x308b;&#x305f;&#x3081;&#x306e;&#x30b3;&#x30fc;&#x30c9;&#x3092;&#x793a;&#x3059;&#x3002;</p>
<div class="source">
<pre>import java.lang.reflect.Field;

import javax.swing.JButton;
import javax.swing.JFrame;

import org.junit.After;
import org.junit.Assert;
import org.junit.Before;
import org.junit.Test;
import org.slf4j.Logger;
import org.slf4j.LoggerFactory;

import myproject.java.utils.SwingUtils;

public class SwingAppTest implements Runnable {
    /** logger. */
    private static Logger logger = LoggerFactory.getLogger(SwingUtilsTest.class);

    /** window object. */
    private ApplicationWindow applicationWindow = null;
    /** frame object. */
    private JFrame frame = null;

    /** lock object. */
    Object lock = new Object();

    /**
     * &#x30c6;&#x30b9;&#x30c8;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x5b9f;&#x884c;&#x524d;&#x306e;&#x524d;&#x51e6;&#x7406;&#x3092;&#x5b9f;&#x884c;&#x3057;&#x307e;&#x3059;&#x3002;
     * &lt;p&gt;
     * &#x5225;&#x30b9;&#x30ec;&#x30c3;&#x30c9;&#x3067;&#x30a6;&#x30a3;&#x30f3;&#x30c9;&#x30a6;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x8d77;&#x52d5;&#x3057;&#x3001;&#x305d;&#x306e;&#x521d;&#x671f;&#x5316;&#x304c;&#x7d42;&#x308f;&#x308b;&#x307e;&#x3067;&#x5f85;&#x6a5f;&#x3057;&#x307e;&#x3059;&#x3002;
     */
    @Before
    public void setUp() {
        synchronized(this.lock) {
            try {
                // &#x5225;&#x30b9;&#x30ec;&#x30c3;&#x30c9;&#x3067;&#x30a6;&#x30a3;&#x30f3;&#x30c9;&#x30a6;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x8d77;&#x52d5;&#x3059;&#x308b;
                new Thread(this).start();
                // &#x30a6;&#x30a3;&#x30f3;&#x30c9;&#x30a6;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x521d;&#x671f;&#x5316;&#x304c;&#x7d42;&#x308f;&#x308b;&#x307e;&#x3067;&#x5f85;&#x3064;
                this.lock.wait();
            } catch (InterruptedException e) { }
        }
    }

    /**
     * &#x30a6;&#x30a3;&#x30f3;&#x30c9;&#x30a6;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x8d77;&#x52d5;&#x3057;&#x3001;&#x30a6;&#x30a3;&#x30f3;&#x30c9;&#x30a6;&#x3092;&#x53ef;&#x8996;&#x5316;&#x3057;&#x307e;&#x3059;&#x3002;
     */
    @Override
    public void run() {
        try {
            this.applicationWindow = new ApplicationWindow();

            // JFrame&#x3092;&#x53d6;&#x5f97;&#x3059;&#x308b;
            Field frameField = applicationWindow.getClass().getDeclaredField(&quot;frame&quot;);
            frameField.setAccessible(true);
            this.frame = (JFrame) frameField.get(this.applicationWindow);

            // &#x30a6;&#x30a3;&#x30f3;&#x30c9;&#x30a6;&#x3092;&#x53ef;&#x8996;&#x5316;&#x3059;&#x308b;
            this.frame.setVisible(true);
            synchronized(this.lock) {
                // &#x30e1;&#x30a4;&#x30f3;&#x30b9;&#x30ec;&#x30c3;&#x30c9;&#x306e;&#x5b9f;&#x884c;&#x3092;&#x518d;&#x958b;&#x3059;&#x308b;
                this.lock.notifyAll();
            }
        } catch (Exception e) {
            e.printStackTrace();
        }
    }

    /**
     * &#x30c6;&#x30b9;&#x30c8;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x5b9f;&#x884c;&#x5f8c;&#x306e;&#x5f8c;&#x51e6;&#x7406;&#x3092;&#x5b9f;&#x884c;&#x3057;&#x307e;&#x3059;&#x3002;
     * &lt;p&gt;
     * &#x5225;&#x30b9;&#x30ec;&#x30c3;&#x30c9;&#x3067;&#x5b9f;&#x884c;&#x3055;&#x308c;&#x305f;&#x30a6;&#x30a3;&#x30f3;&#x30c9;&#x30a6;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x7d42;&#x4e86;&#x3057;&#x307e;&#x3059;&#x3002;
     */
    @After
    public void tearDown() {
        if (this.frame != null) {
            this.frame.dispose();
            this.frame = null;
            this.applicationWindow = null;
        }
    }

    /**
     */
    @Test
    public void testSwingApplication() {
        // &#x30a6;&#x30a3;&#x30f3;&#x30c9;&#x30a6;&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x30af;&#x30e9;&#x30b9;&#x306e;&#x30d5;&#x30a3;&#x30fc;&#x30eb;&#x30c9;&#x3067;&#x5b9a;&#x7fa9;&#x3055;&#x308c;&#x305f;JButton&#x3092;&#x53d6;&#x5f97;
        Field button1Field = applicationWindow.getClass().getDeclaredField(&quot;button1&quot;);
        button1Field.setAccessible(true);
        JButton button1 = (JButton) button1Field.get(this.applicationWindow);
        // JButton&#x306e;&#x30af;&#x30ea;&#x30c3;&#x30af;&#x30a4;&#x30d9;&#x30f3;&#x30c8;&#x3092;&#x5b9f;&#x884c;
        button1.doClick();
        // &#x30dc;&#x30bf;&#x30f3;&#x3092;&#x30af;&#x30ea;&#x30c3;&#x30af;&#x3057;&#x305f;&#x6642;&#x306e;&#x30c6;&#x30b9;&#x30c8;&#x30b3;&#x30fc;&#x30c9;&#x3092;&#x8a18;&#x8ff0;&#x3059;&#x308b;
        ...

        // SwingUtils&#x3092;&#x4f7f;&#x7528;&#x3057;&#x3066;&#x3001;name&#x5c5e;&#x6027;&#x306e;&#x5024;&#x304b;&#x3089;JButton&#x3092;&#x53d6;&#x5f97;
        JButton button2 = (JButton) SwingUtils.getComponentByName(this.frame.getContentPane(), &quot;button2&quot;);
        // JButton&#x306e;&#x30af;&#x30ea;&#x30c3;&#x30af;&#x30a4;&#x30d9;&#x30f3;&#x30c8;&#x3092;&#x5b9f;&#x884c;
        button2.doClick();
        // &#x30dc;&#x30bf;&#x30f3;&#x3092;&#x30af;&#x30ea;&#x30c3;&#x30af;&#x3057;&#x305f;&#x6642;&#x306e;&#x30c6;&#x30b9;&#x30c8;&#x30b3;&#x30fc;&#x30c9;&#x3092;&#x8a18;&#x8ff0;&#x3059;&#x308b;
        ....
    }
}</pre></div></section><section>
<h3><a name="a.E3.83.86.E3.82.B9.E3.83.88.E3.83.97.E3.83.AD.E3.82.B0.E3.83.A9.E3.83.A0.E3.81.AE.E8.AA.AC.E6.98.8E"></a>&#x30c6;&#x30b9;&#x30c8;&#x30d7;&#x30ed;&#x30b0;&#x30e9;&#x30e0;&#x306e;&#x8aac;&#x660e;</h3>
<ol style="list-style-type: decimal">
<li>&#x6982;&#x8981;
<p>&#x30c6;&#x30b9;&#x30c8;&#x30d7;&#x30ed;&#x30b0;&#x30e9;&#x30e0;&#x306f;&#x3001;&#x5225;&#x30b9;&#x30ec;&#x30c3;&#x30c9;&#x3067;Swing&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x8d77;&#x52d5;&#x3057;&#x3066;&#x304a;&#x304d;&#x3001;&#x30c6;&#x30b9;&#x30c8; &#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x306f;Swing&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x30b3;&#x30f3;&#x30dd;&#x30fc;&#x30cd;&#x30f3;&#x30c8;&#x3092;&#x53d6;&#x5f97;&#x3057;&#x3066;&#x3001;&#x30a4;&#x30d9;&#x30f3;&#x30c8;&#x3092;&#x5b9f;&#x884c; &#x3057;&#x305f;&#x308a;&#x30b3;&#x30f3;&#x30dd;&#x30fc;&#x30cd;&#x30f3;&#x30c8;&#x306e;&#x8a2d;&#x5b9a;&#x5185;&#x5bb9;&#x3092;&#x78ba;&#x8a8d;&#x3057;&#x305f;&#x308a;&#x3059;&#x308b;&#x3002;&#x305d;&#x306e;&#x305f;&#x3081;&#x3001;&#x30c6;&#x30b9;&#x30c8;&#x30af;&#x30e9;&#x30b9;&#x306f; Runnable&#x30a4;&#x30f3;&#x30bf;&#x30fc;&#x30d5;&#x30a7;&#x30fc;&#x30b9;&#x3092;&#x5b9f;&#x88c5;&#x3059;&#x308b;&#x3002;</p></li>
<li>@Before public void setUp()
<p>&#x30c6;&#x30b9;&#x30c8;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x524d;&#x306e;&#x524d;&#x51e6;&#x7406;&#x3068;&#x3057;&#x3066;&#x3001;&#x30ed;&#x30c3;&#x30af;&#x3092;&#x8a2d;&#x5b9a;&#x3057;&#x3066;&#x30b9;&#x30ec;&#x30c3;&#x30c9;&#x3092;&#x65b0;&#x898f;&#x306b; &#x4f5c;&#x6210;&#x3057;&#x30c6;&#x30b9;&#x30c8;&#x30d7;&#x30ed;&#x30b0;&#x30e9;&#x30e0;&#x306e;run&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x3059;&#x308b;&#x3002;</p></li>
<li>@Override public void run()
<ul>
<li>Swing&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;</li>
<li>Swing&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x30af;&#x30e9;&#x30b9;&#x30d5;&#x30a3;&#x30fc;&#x30eb;&#x30c9;&#x306b;&#x8a2d;&#x5b9a;&#x3055;&#x308c;&#x305f;JFrame&#x3092;&#x53d6;&#x5f97;&#x3057;&#x3066;&#x3001; &#x30c6;&#x30b9;&#x30c8;&#x30af;&#x30e9;&#x30b9;&#x306e;&#x30d5;&#x30a3;&#x30fc;&#x30eb;&#x30c9;&#x306b;&#x8a2d;&#x5b9a;&#x3059;&#x308b;</li>
<li>Swing&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x306e;&#x30a6;&#x30a3;&#x30f3;&#x30c9;&#x30a6;&#x3092;&#x53ef;&#x8996;&#x5316;&#x3057;&#x305f;&#x5f8c;&#x306b;&#x30ed;&#x30c3;&#x30af;&#x3092;&#x89e3;&#x9664;&#x3057;&#x3066;&#x3001; &#x30c6;&#x30b9;&#x30c8;&#x30d7;&#x30ed;&#x30b0;&#x30e9;&#x30e0;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x30b9;&#x30ec;&#x30c3;&#x30c9;&#x3092;&#x518d;&#x958b;&#x3059;&#x308b;</li></ul></li>
<li>@Test public void testSwingApplication()
<p>&#x30c6;&#x30b9;&#x30c8;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x3002;Swing&#x306e;&#x30b3;&#x30f3;&#x30dd;&#x30fc;&#x30cd;&#x30f3;&#x30c8;&#x306b;&#x306f;&#x3001;&#x4ee5;&#x4e0b;&#x306e;&#x65b9;&#x6cd5;&#x3067;&#x30a2;&#x30af;&#x30bb;&#x30b9;&#x3059;&#x308b;&#x3002;</p>
<ul>
<li>Reflecttion(java.lang.reflect.Field&#x30af;&#x30e9;&#x30b9;)&#x3092;&#x4f7f;&#x7528;&#x3057;&#x3066;&#x3001;&#x30a6;&#x30a3;&#x30f3;&#x30c9;&#x30a6; &#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x30af;&#x30e9;&#x30b9;&#x306e;&#x30d5;&#x30a3;&#x30fc;&#x30eb;&#x30c9;&#x306b;&#x8a2d;&#x5b9a;&#x3055;&#x308c;&#x305f;&#x30b3;&#x30f3;&#x30dd;&#x30fc;&#x30cd;&#x30f3;&#x30c8;&#x306e; &#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x53d6;&#x5f97;&#x3059;&#x308b;</li>
<li>Javautils&#x30d7;&#x30ed;&#x30b8;&#x30a7;&#x30af;&#x30c8;&#x306e;SwingUtils&#x30af;&#x30e9;&#x30b9;&#x3092;&#x4f7f;&#x7528;&#x3057;&#x3066;&#x3001;&#x30b3;&#x30f3;&#x30dd;&#x30fc;&#x30cd;&#x30f3;&#x30c8;&#x306e; name&#x5c5e;&#x6027;&#x306e;&#x5024;&#x3092;&#x6307;&#x5b9a;&#x3057;&#x3066;&#x30b3;&#x30f3;&#x30dd;&#x30fc;&#x30cd;&#x30f3;&#x30c8;&#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x53d6;&#x5f97;&#x3059;&#x308b;</li></ul>
<p>Swing&#x30b3;&#x30f3;&#x30dd;&#x30fc;&#x30cd;&#x30f3;&#x30c8;&#x306e;&#x30a4;&#x30f3;&#x30b9;&#x30bf;&#x30f3;&#x30b9;&#x3092;&#x53d6;&#x5f97;&#x3057;&#x305f;&#x3089;&#x3001;&#x30a4;&#x30d9;&#x30f3;&#x30c8;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x305f;&#x3081;&#x306e; &#x30b3;&#x30f3;&#x30dd;&#x30fc;&#x30cd;&#x30f3;&#x30c8;&#x306e;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x3092;&#x5b9f;&#x884c;&#x3057;&#x305f;&#x5f8c;&#x306b;&#x3001;&#x30b3;&#x30f3;&#x30dd;&#x30fc;&#x30cd;&#x30f3;&#x30c8;&#x306e;&#x5c5e;&#x6027;&#x3092;&#x8abf;&#x3079;&#x308b;&#x306a;&#x3069; &#x3057;&#x3066;&#x30c6;&#x30b9;&#x30c8;&#x3092;&#x5b9f;&#x884c;&#x3059;&#x308b;&#x3002;</p></li>
<li>@After public void tearDown()
<p>&#x30c6;&#x30b9;&#x30c8;&#x30e1;&#x30bd;&#x30c3;&#x30c9;&#x5b9f;&#x884c;&#x5f8c;&#x306e;&#x5f8c;&#x51e6;&#x7406;&#x3068;&#x3057;&#x3066;&#x3001;Swing&#x30a2;&#x30d7;&#x30ea;&#x30b1;&#x30fc;&#x30b7;&#x30e7;&#x30f3;&#x3092;&#x5f37;&#x5236;&#x7d42;&#x4e86;&#x3059;&#x308b;&#x3002;</p></li></ol></section></section>
      </div>
    </div>
    <div class="clear">
      <hr/>
    </div>
    <div id="footer">
      <div class="xright">
        Copyright &#169;      2022ycookjp my project.
.      </div>
      <div class="clear">
        <hr/>
      </div>
    </div>
  </body>
</html>
